## Production: api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show Summary</summary>

| CHANGE |                                             NAME                                             |
|--------|----------------------------------------------------------------------------------------------|
| add    | `module.resolver_dns.aws_route53_resolver_firewall_domain_list.allowed[0]`                   |
|        | `module.resolver_dns.aws_route53_resolver_firewall_domain_list.blocked[0]`                   |
|        | `module.resolver_dns.aws_route53_resolver_firewall_rule.allowed[0]`                          |
|        | `module.resolver_dns.aws_route53_resolver_firewall_rule.blocked[0]`                          |
|        | `module.resolver_dns.aws_route53_resolver_firewall_rule_group.firewall_rules[0]`             |
|        | `module.resolver_dns.aws_route53_resolver_firewall_rule_group_association.firewall_rules[0]` |
| update | `module.resolver_dns.aws_cloudwatch_log_group.route53_vpc_dns`                               |
|        | `module.resolver_dns.aws_cloudwatch_log_resource_policy.route53_vpc_dns`                     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.resolver_dns.data.aws_iam_policy_document.route53_resolver_logging_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "route53_resolver_logging_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + "arn:aws:logs:ca-central-1:806545929748:log-group:/aws/route53/vpc-04cc4c1a5a2e97d9a/*",
            ]

          + principals {
              + identifiers = [
                  + "route53.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.resolver_dns.aws_cloudwatch_log_group.route53_vpc_dns will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "route53_vpc_dns" {
        id                = "/aws/route53/vpc-04cc4c1a5a2e97d9a"
        name              = "/aws/route53/vpc-04cc4c1a5a2e97d9a"
      ~ retention_in_days = 14 -> 30
      ~ tags              = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      ~ tags_all          = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
        # (1 unchanged attribute hidden)
    }

  # module.resolver_dns.aws_cloudwatch_log_resource_policy.route53_vpc_dns will be updated in-place
  ~ resource "aws_cloudwatch_log_resource_policy" "route53_vpc_dns" {
        id              = "route53_resolver_logging_policy"
      ~ policy_document = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "route53.amazonaws.com"
                        }
                      - Resource  = "arn:aws:logs:ca-central-1:806545929748:log-group:/aws/route53/vpc-04cc4c1a5a2e97d9a/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.resolver_dns.aws_route53_resolver_firewall_domain_list.allowed[0] will be created
  + resource "aws_route53_resolver_firewall_domain_list" "allowed" {
      + arn      = (known after apply)
      + domains  = [
          + "*.amazonaws.com.",
          + "*.cyber.gc.ca.",
          + "current.cvd.clamav.net.",
          + "database.clamav.net.",
        ]
      + id       = (known after apply)
      + name     = "AllowedDomains"
      + tags     = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
    }

  # module.resolver_dns.aws_route53_resolver_firewall_domain_list.blocked[0] will be created
  + resource "aws_route53_resolver_firewall_domain_list" "blocked" {
      + arn      = (known after apply)
      + domains  = [
          + "*.",
        ]
      + id       = (known after apply)
      + name     = "BlockedDomains"
      + tags     = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
    }

  # module.resolver_dns.aws_route53_resolver_firewall_rule.allowed[0] will be created
  + resource "aws_route53_resolver_firewall_rule" "allowed" {
      + action                  = "ALLOW"
      + firewall_domain_list_id = (known after apply)
      + firewall_rule_group_id  = (known after apply)
      + id                      = (known after apply)
      + name                    = "AllowedDomains"
      + priority                = 100
    }

  # module.resolver_dns.aws_route53_resolver_firewall_rule.blocked[0] will be created
  + resource "aws_route53_resolver_firewall_rule" "blocked" {
      + action                  = "BLOCK"
      + block_response          = "NODATA"
      + firewall_domain_list_id = (known after apply)
      + firewall_rule_group_id  = (known after apply)
      + id                      = (known after apply)
      + name                    = "BlockedDomains"
      + priority                = 200
    }

  # module.resolver_dns.aws_route53_resolver_firewall_rule_group.firewall_rules[0] will be created
  + resource "aws_route53_resolver_firewall_rule_group" "firewall_rules" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + name         = "FirewallRules"
      + owner_id     = (known after apply)
      + share_status = (known after apply)
      + tags         = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all     = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
    }

  # module.resolver_dns.aws_route53_resolver_firewall_rule_group_association.firewall_rules[0] will be created
  + resource "aws_route53_resolver_firewall_rule_group_association" "firewall_rules" {
      + arn                    = (known after apply)
      + firewall_rule_group_id = (known after apply)
      + id                     = (known after apply)
      + mutation_protection    = (known after apply)
      + name                   = "FirewallRules"
      + priority               = 101
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-04cc4c1a5a2e97d9a"
    }

Plan: 6 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.clamav-defs.aws_s3_bucket.this,
  on .terraform/modules/clamav-defs/S3/main.tf line 7, in resource "aws_s3_bucket" "this":
   7: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 23 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr_api"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr_dkr"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.sts"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_ip_set.ip_allowlist"]
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_firewall_rule_group_association.firewall_rules[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_query_log_config.route53_vpc_dns"]

26 tests, 17 passed, 9 warnings, 0 failures, 0 exceptions

```

</details>
